app/views/pages/index.html.erb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1
---
                    <p><%= frit.content %></p>
                    <span class="monospace">by <%=link_to(frit.user.email.split('@').first, user_path((frit.user).id)) %></span>