app/controllers/frits_controller.rb

SELECT "prompts".* FROM "prompts"
SELECT "limits".* FROM "limits"
---
	def new
		prompts = Prompt.all
		limits = Limit.all

INSERT INTO "frits" ("content", "created_at", "limit", "posted_on", "prompt", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def create
		@frit = Frit.new
		@frit.content = params[:frit][:content]
		@frit.posted_on = DateTime.now
		@frit.user = current_user
		@frit.prompt = params[:frit][:prompt]
		@frit.limit = params[:frit][:limit]
		if @frit.save

SELECT  "frits".* FROM "frits"  WHERE "frits"."id" = ? LIMIT 1  [["id", 5]]
---
	def edit
		@frit = Frit.find(params[:id])

SELECT  "frits".* FROM "frits"  WHERE "frits"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "frits" SET "content" = ?, "updated_at" = ? WHERE "frits"."id" = 5  [["content", "i am dinosaur hear me roar"], ["updated_at", "2014-05-24 03:26:36.792172"]]
---
	def update
		@frit =Frit.find(params[:id])
		@back_up_frit = Frit.find(params[:id])
		@frit.content = params[:frit][:content]
		if @frit.save

SELECT  "frits".* FROM "frits"  WHERE "frits"."id" = ? LIMIT 1  [["id", 9]]
DELETE FROM "frits" WHERE "frits"."id" = ?  [["id", 9]]
---
	def destroy
		@frit = Frit.find(params[:id])
		@frit.destroy!