app/controllers/pages_controller.rb

SELECT  "frits".* FROM "frits"   ORDER BY "frits"."id" DESC LIMIT 10
---
	def index
		@latest_frits = Frit.last(10)

SELECT "frits".* FROM "frits"
---
	def show
		@frits = Frit.all